airfoil/0-AoA/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pOut            0;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pOut;

boundaryField
{

    oversetFaces
    {
        type overset;
        value uniform 0;
        coupledFringe yes;
        conservativeCorrection yes;
        setHoleCellValue  yes;
        holeCellValue     0;
    }

    in
    {
        type            zeroGradient;
    }
    out
    {
        type            fixedValue;
        value           uniform $pOut;
    }

    top
    {
        type zeroGradient;
    }
    bottom
    {
        type zeroGradient;
    }



   back
    {
        type            empty;
    }

   front
    {
        type            empty;
    }

    wall
    {
        type            zeroGradient;
    }

    cylinder
    {
        type            zeroGradient;
    }

    //#includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
